{"keras_version": "2.0.4", "class_name": "Sequential", "config": [{"class_name": "LSTM", "config": {"implementation": 0, "dtype": "float32", "name": "lstm_1", "stateful": true, "go_backwards": false, "use_bias": true, "kernel_constraint": null, "bias_constraint": null, "units": 2, "recurrent_regularizer": null, "dropout": 0.0, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_activation": "hard_sigmoid", "activation": "tanh", "batch_input_shape": [1, 1, 1], "recurrent_constraint": null, "return_sequences": false, "kernel_regularizer": null, "activity_regularizer": null, "recurrent_dropout": 0.0, "unit_forget_bias": true, "bias_regularizer": null, "unroll": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}}}, {"class_name": "Dense", "config": {"activation": "linear", "name": "dense_1", "use_bias": true, "kernel_regularizer": null, "trainable": true, "bias_constraint": null, "units": 1, "activity_regularizer": null, "kernel_constraint": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}}}], "backend": "theano"}